//********************************************************************************************************
// File name		: Bluetooth.h
// Description 		: Bluetooth.c的头文件
// Author			: Keno
// Date				: 2016.8.8
// Version			: V02
//--------------------------------------------------------------------------------------------------------
// Info				: 
//********************************************************************************************************
#ifndef _BLUETOOTH_H_
#define _BLUETOOTH_H_


//******************************************** 头文件声明 **********************************************//
#include <project.h>
#include "CmdProtocol.h"
#include "OTAMandatory.h"
#include "config.h"	
	
//********************************************* 宏定义 *************************************************//
#define CYBLE_MTU_LEN						20



//******************************************* 外部变量声明 *********************************************//
extern uint16 CurrentCommandPktTotalSize;
extern uint8  CurrentDataNum;
extern uint8  BleCmdBuf[DATABUF_SIZE];
extern uint8  BleCmdValidFlag;



//********************************************* 函数声明 ***********************************************//
int BleSend(uint8 *data, uint16 length);
uint8 BleRecv(uint8 *cmd, uint16 len);


#endif

//******************************************** END OF FILE **********************************************
